CodeSource/Web/Version4.0/racine_recits_esclave/racine/app/Models/ModelCouches.php

    public function search_place($data)
    {

		$type = $this->db->escapeLikeString($data['type']);

        return $this->asArray()
        ->join('tab_recits_v3', 'points.id_recit = tab_recits_v3.id_recit')
        ->like(['points.type'=> $type])
        ->findAll();
---
SELECT *
FROM `points`
JOIN `tab_recits_v3` ON `points`.`id_recit` = `tab_recits_v3`.`id_recit`
WHERE `points`.`type` LIKE '%deces%' ESCAPE '!'