CodeSource/Web/Version3/racine_recit_resclave/racine/app/Models/ModelMap.php

    public function getPoints()
	{

        return $this->asArray()
	    ->join('tab_recits_v3', 'points.id_recit = tab_recits_v3.id_recit')
        ->Where(['points.type'=> 'publication'])
        ->findAll(60);
---
SELECT *
FROM `points`
JOIN `tab_recits_v3` ON `points`.`id_recit` = `tab_recits_v3`.`id_recit`
WHERE `points`.`type` = 'publication'
 LIMIT 60