CodeSource/Web/Version3/racine_recit_resclave/racine/app/Models/ModelCouches.php

SELECT *
FROM `map3`
JOIN `tab_recits_v3` ON `map3`.`id_recit` = `tab_recits_v3`.`id_recit`
WHERE `map3`.`id_recit` = '56'
 LIMIT 100
---
    public function search_adv($data)
	{
		$idr = $this->db->escapeLikeString($data['id_recit']);

        return $this->asArray()
        ->join('tab_recits_v3', 'map3.id_recit = tab_recits_v3.id_recit')
        ->Where(['map3.id_recit' => $idr])
        ->findAll(100);

SELECT *
FROM `points`
JOIN `tab_recits_v3` ON `points`.`id_recit` = `tab_recits_v3`.`id_recit`
WHERE `points`.`id_recit` = '56'
---
    public function search_pts($data)
	{
		$idr2 = $this->db->escapeLikeString($data['id_recit']);

        return $this->asArray()
        ->join('tab_recits_v3', 'points.id_recit = tab_recits_v3.id_recit')
        ->Where(['points.id_recit'=> $idr2])
        ->findAll();

SELECT *
FROM `poly`
JOIN `tab_recits_v3` ON `poly`.`id_recit` = `tab_recits_v3`.`id_recit`
WHERE `poly`.`id_recit` = '56'
---
    public function search_poly($data)
	{
		$idr = $this->db->escapeLikeString($data['id_recit']);

        return $this->asArray()
        ->join('tab_recits_v3', 'poly.id_recit = tab_recits_v3.id_recit')
        ->Where(['poly.id_recit'=> $idr])
        ->findAll();